This file contains all of my notes around the work for CHAIN and E-CHAIM.
This will contain a work log as well as todo items that need to be tracked.

* [2023-02-07 Tue]
** Emails and planning
   :LOGBOOK:
   CLOCK: [2023-02-07 Tue 08:00]--[2023-02-07 Tue 08:56] =>  0:56
   :END:

** TODO MODIS code development
   :LOGBOOK:
   CLOCK: [2023-02-07 Tue 09:15]--[2023-02-07 Tue 11:30] =>  2:15
   CLOCK: [2023-02-06 Mon 11:01]--[2023-02-06 Mon 13:30] =>  2:29
   :END:

** DONE Turning off gitlab
   CLOSED: [2023-02-07 Tue 09:07]
   :LOGBOOK:
   CLOCK: [2023-02-07 Tue 08:45]--[2023-02-07 Tue 09:07] =>  0:22
   :END:
   Done with the command
   #+BEGIN_SRC sh
   sudo systemctl stop gitlab-runsvdir
   sudo systemctl disable gitlab-runsvdir
   #+END_SRC



** Helped Sadig with a data download problem. It looks like the server from NASA is the having problems. When I get to ~3-4 GB, I get an error in the bytes being served. I used the following command:
#+BEGIN_SRC bash
wget "https://pds-ppi.igpp.ucla.edu/ditdos/write?id=pds://PPI/maven.mag.calibrated/data/ss/highres/2021/12/mvn_mag_l2_2021364ss_20211230_v01_r01&f=csv"
#+END_SRC


* [2023-02-06 Mon]
** DONE Go add a new drive to chain-mirror
   CLOSED: [2023-02-07 Tue 08:57]
   :LOGBOOK:
   CLOCK: [2023-02-06 Mon 13:42]--[2023-02-06 Mon 14:00] =>  0:18
   :END:



* [2021-11-29 Mon]
** Got caught up with emails, etc
** Continued work on the FPGA dashboard
** Sent a note to Jonathan about using a new drop for chain-new


* [2021-11-10 Wed]
** Updated the plot ionogram matlab script on chain-data2 for Anton
** IQA had a power outage. Trimble was saying that they lost data connection. Richard looked at it and found that we have been sending data since the power came back up. He responded to Trimble.


* [2021-11-09 Tue]
** David mentioned that the HTTP forwards for the chaim sites isn't working. Created issue https://github.com/UNB-Radio-Physics/sysops/issues/478
** Told Richard about how to manage resolv.conf through adding entries to dhcpcd.conf on Raspbian
** While talking to Nick, discovered an issue on the CHAIM web app where putting a single zero in the time box causes an error. Need to include as a check on the form https://github.com/UNB-Radio-Physics/sysops/issues/479
** Torsten is done, so I shutdown gitlab on chain-new again
** I fixed the CHAIM HTTP forwards. The rest of his comment will need to wait until we get a domain certificate for all of our sites.


* [2021-11-08 Mon]
** Asked ITS to make changes to the firewall rules
*** Add daw
*** Remove bli, cbb, iqa and kug
** Responded to Nathan at NRCan. They lost data connection because of a network outage on Saturday. Everything is good again.
** Started up gitlab on chain-new and created an account for Torsten. Sent him an email to let him know.
